//Задано два масиви чисел. Потрібно вивести ті елементи першого масиву (у том ж порядку, у якому вони йдуть у першому масиві), яких немає у другому масиві.
#include <iostream>
#include <Windows.h>// підключення заголовного файлу Windows.h, завдяки чому зможемо використовувати українську мову
using namespace std;
int main() {
    SetConsoleCP(1251); // встановлення кодування Windows-1251 в  потік введення
    SetConsoleOutputCP(1251); // встановлення кодування Windows-1251 в  потік виведення
    bool check;//оголошуємо змінну check для перевірки однакових елементів масиву
    const int n = 100;//стале значення
    const int m = 100;//стале значення
    int size1, size2, k = 0;//оголошуємо розмірність масивів size1, size2 та кількість елементів масиву k
    int  arr1[n];//оголошуємо масив arr1 з кількістю елементів n
    int  arr2[m];//оголошуємо масив arr2 з кількістю елементів m
    int  arr3[m];//оголошуємо масив arr3 з кількістю елементів m або можна n
    cout << "Введіть розмір   size1  елементів першого масиву" << endl;
    cin >> size1;
    cout << "Введіть елементи першого масиву" << endl;
    for (int i = 0; i < size1; i++) {//використовуємо цикл для введення елементів масиву
        cin >> arr1[i];// вводимо елементи масиву arr1[i]
    }
    cout << "Введіть розмір   size2  елементів другого масиву" << endl;
    cin >> size2;
    cout << "Введіть елементи другого масиву" << endl;
    for (int i = 0; i < size2; i++) {//використовуємо цикл для введення елементів масиву
        cin >> arr2[i];// вводимо елементи масиву arr1[i]
    }
    for (int i = 0; i < size1; i++) {//використовуємо цикл для перевірки елементів першого масиву
        check = true;
        for (int j = 0; j < size2; j++)//використовуємо цикл для перевірки елементів другго масиву
            if (arr1[i] == arr2[j]) {//якщо елементи першого масиву та другого однакові, то
                check = false;// значення хибне
            }
        if (check == true) {//якщо значення вірне- елементи першого та друго масиву різні  , то
            arr3[k] = arr1[i];//присвоюємо значення неоднакових елементів масиву - іншому масиву- який буде складатися із елементів не таких як в другому масиві
            k++;//підраховуємо кількість таких елементів
        }
    }
    cout << k << endl;//виводимо кількість неоднакових елементів першого масиву з другим
    for (int i = 0; i < k; i++) {//створюємо цикл для виведення елементів першого масиву- яких немає у другому
        cout << arr3[i] << " ";//виведення елементів у тому ж порядку
    }
}